In [1]:
import sqlite3
import os
from sqlalchemy import create_engine, text
import pandas as pd

In [21]:
os.getcwd()

'c:\\Users\\igbopa\\Desktop\\REPO TRABAJO\\2-Data_Analysis\\6-Bases_de_datos\\SQL\\Ejercicios\\murder_game\\data'

In [18]:
engine = create_engine('sqlite:///sql-murder-mystery.db')

In [19]:
query = '''

SELECT * FROM sqlite_master
WHERE type = "table"

'''

pd.read_sql(query,con=engine)

,type,name,tbl_name,rootpage,sql
0,table,crime_scene_report,crime_scene_report,2,CREATE TABLE crime_scene_report (\n dat...
1,table,drivers_license,drivers_license,3,CREATE TABLE drivers_license (\n id int...
2,table,person,person,4,CREATE TABLE person (\n id integer PRIM...
3,table,facebook_event_checkin,facebook_event_checkin,5,CREATE TABLE facebook_event_checkin (\n ...
4,table,interview,interview,6,CREATE TABLE interview (\n person_id in...
5,table,get_fit_now_member,get_fit_now_member,7,CREATE TABLE get_fit_now_member (\n id ...
6,table,get_fit_now_check_in,get_fit_now_check_in,9,CREATE TABLE get_fit_now_check_in (\n m...
7,table,income,income,10,CREATE TABLE income (\n ssn integer PRI...
8,table,solution,solution,11,"CREATE TABLE solution (\n user integer,..."

In [22]:
query = '''

SELECT * FROM crime_scene_report

'''
pd.read_sql(query,con=engine)

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City
...,...,...,...,...
1223,20180430,bribery,\n,Garden Grove
1224,20180430,fraud,‘Why not?’ said the March Hare.\n,Houma
1225,20180430,assault,\n,Fontana
1226,20180501,assault,be NO mistake about it: it was neither more no...,Trenton
1227,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [35]:
query = '''

SELECT * FROM crime_scene_report
WHERE city = "SQL City" AND type = "murder"

'''
pd.read_sql(query,con=engine).iloc[2,2]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

In [43]:
query = '''

SELECT * FROM person
WHERE address_street_name = "Northwestern Dr"
ORDER BY "address_number" DESC
'''
pd.read_sql(query,con=engine).loc[0]

id                               14887
name                    Morty Schapiro
license_id                      118009
address_number                    4919
address_street_name    Northwestern Dr
ssn                          111564949
Name: 0, dtype: object

In [55]:
query = '''

SELECT * FROM interview
WHERE person_id = 14887
'''
pd.read_sql(query,con=engine).loc[0,"transcript"]

#I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z".
#Only gold members have those bags. The man got into a car with a plate that included "H42W".'

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [58]:
query = '''

SELECT * FROM get_fit_now_member
WHERE id LIKE "48Z%" AND membership_status = "gold"
'''
pd.read_sql(query,con=engine)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [62]:
query = '''

SELECT * FROM person
WHERE id = 28819 OR id = 67318
'''
pd.read_sql(query,con=engine)

,id,name,license_id,address_number,address_street_name,ssn
0,28819,Joe Germuska,173289,111,Fisk Rd,138909730
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [59]:
query = '''

SELECT * FROM drivers_license
WHERE plate_number LIKE "%H42W%"
'''
pd.read_sql(query,con=engine)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [ ]:
#Suspect is Jeremy Bowers

In [48]:
query = '''

SELECT * FROM person
WHERE address_street_name = "Franklin Ave" AND name LIKE "Annabel%"
'''
pd.read_sql(query,con=engine).loc[0]

id                              16371
name                   Annabel Miller
license_id                     490173
address_number                    103
address_street_name      Franklin Ave
ssn                         318771143
Name: 0, dtype: object

In [66]:
query = '''

SELECT * FROM interview
WHERE person_id = 16371
'''
pd.read_sql(query,con=engine).loc[0,"transcript"]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

In [76]:
query = '''

SELECT * FROM get_fit_now_check_in
WHERE check_in_date IS '20180109'
'''
pd.read_sql(query,con=engine)

  membership_id  check_in_date  check_in_time  check_out_time
0         X0643       20180109            957            1164
1         UK1F2       20180109            344             518
2         XTE42       20180109            486            1124
3         1AE2H       20180109            461             944
4         6LSTG       20180109            399             515
5         7MWHJ       20180109            273             885
6         GE5Q8       20180109            367             959
7         48Z7A       20180109           1600            1730
8         48Z55       20180109           1530            1700
9         90081       20180109           1600            1700

In [ ]:
#Jeremy Bowers is the suspect and the killer (Cadena Perpetua)